cool/tutorials/compressible/rhoPorousMRFPimpleFoam/mixerVessel2D/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMeshLib "libtopoChangerFvMesh.so";

dynamicFvMesh   mixerFvMesh;

mixerFvMeshCoeffs
{
    coordinateSystem
    {
        type            cylindrical;
        origin          ( 0 0 0 );
        axis            ( 0 0 1 );
        direction       ( 1 0 0 );
    }

    rpm             10;

    slider
    {
        inside          insideSlider;
        outside         outsideSlider;
    }
}

// ************************************************************************* //
